# GetComponents

## Description
Gets the components of the object.

```pascal
FUNCTION GetComponents(object : HANDLE) : HANDLE;
```

```python

def vs.GetComponents(object):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, round wall, slab, Wall Style, Slab Style, the Wall Preferences, or the Slab Preferences.|

## Version
Availability: from Vectorworks 2015
## Category
* Objects - Architectural